{
  "common": {
    "singleton": true,
    "name": "snmp",
    "version": "3.2.0",
    "news": {
      "3.2.0": {
        "en": "Adapter requires node.js 18 and js-controller >= 5 now\nDependencies have been updated",
        "de": "Adapter benötigt node.js 18 und js-controller >= 5 jetzt\nAbhängigkeiten wurden aktualisiert",
        "ru": "Адаптер требует node.js 18 и js-controller >= 5 сейчас\nЗависимость обновлена",
        "pt": "Adapter requer node.js 18 e js-controller >= 5 agora\nAs dependências foram atualizadas",
        "nl": "Adapter vereist node.js 18 en js-controller Nu 5\nAfhankelijkheden zijn bijgewerkt",
        "fr": "Adaptateur nécessite node.js 18 et js-controller >= 5 maintenant\nLes dépendances ont été actualisées",
        "it": "Adattatore richiede node.js 18 e js-controller >= 5 ora\nLe dipendenze sono state aggiornate",
        "es": "Adaptador requiere node.js 18 y js-controller √= 5 ahora\nSe han actualizado las dependencias",
        "pl": "Adapter wymaga node.js 18 i sterownika js- > = 5 teraz\nZaktualizowano zależności",
        "uk": "Адаптер вимагає node.js 18 і js-controller >= 5 тепер\nЗалежність було оновлено",
        "zh-cn": "适配器需要节点.js 18和js控制器 QQ 现在5号\n依赖关系已更新"
      },
      "3.1.0": {
        "en": "Requirements have been updated. Adapter requires node.js 18 or newer now\nPackages have been update to cleanup open dependabot PRs",
        "de": "Die Anforderungen wurden aktualisiert. Adapter benötigt nun node.js 18 oder neuer\nPakete wurden aktualisiert, um offene dependabot PRs zu bereinigen",
        "ru": "Требования были обновлены. Адаптер требует node.js 18 или новее сейчас\nПакеты были обновлены, чтобы очистить открытые иждивот PR",
        "pt": "Os requisitos foram atualizados. Adaptador requer node.js 18 ou mais recente agora\nOs pacotes foram atualizados para limpar PRs de dependente aberto",
        "nl": "Verzoeken zijn geüpdateerd. Adapter vereist node\nPackages zijn bijgewerkt om afhankelijke PR te reinigen",
        "fr": "Les ressources nécessaires ont été actualisées. Adaptateur nécessite node.js 18 ou plus maintenant\nLes paquets ont été mis à jour pour nettoyer les fichiers de dépendance ouverts",
        "it": "I requisiti sono stati aggiornati. Adattatore richiede node.js 18 o più nuovo ora\nI pacchetti sono stati aggiornati per pulire le PR di dipendenza aperte",
        "es": "Se han actualizado las necesidades. Adaptador requiere node.js 18 o nuevo ahora\nLos paquetes han sido actualizados para limpiar las relaciones públicas de dependabot",
        "pl": "Wymagania zostały zaktualizowane. Adapter wymaga węzła 18 lub nowszych\nPakiety zostały zaktualizowane w celu czyszczenia otwartego pakietu zależnego od PR",
        "uk": "Вимоги було оновлено. Адаптер вимагає node.js 18 або новіший зараз\nПакети оновлені для очищення відкритої залежності",
        "zh-cn": "已更新了要求。 现在需要第18或新的人员。\n已经更新了清洁的露天化验。"
      },
      "3.0.0": {
        "en": "updated packages. Minimal node.js version is 16",
        "de": "Pakete aktualisiert. Minimal node.js Version ist nun 16",
        "ru": "обновленные пакеты. Минимальная версия node.js 16",
        "pt": "pacotes atualizados. A versão mínima do node.js é 16",
        "nl": "verhoogde pakketten. Minimale node",
        "fr": "des paquets mis à jour. Minimal node.js version est 16",
        "it": "pacchetti aggiornati. Versione minimal node.js 16",
        "es": "paquetes actualizados. Minimal node.js versión es 16",
        "pl": "zaktualizowane pakiety. Wersja minimalna jest 16",
        "uk": "оновлені пакети. Minimal node.js версія 16",
        "zh-cn": "更新的一揽子计划。 米切尔·诺贝尔版本为16。"
      },
      "2.4.11": {
        "en": "Node-net-snmp has been updated to improve uint32 handling (#282)\nSeveral other dependencies have been updated",
        "de": "Node-net-snmp wurde aktualisiert, um uint32 Handling zu verbessern (#282)\nMehrere andere Abhängigkeiten wurden aktualisiert",
        "ru": "Node-net-snmp был обновлен для улучшения обработки uint32 #(282)\nОбновлены несколько других зависимостей",
        "pt": "Node-net-snmp foi atualizado para melhorar uint32 manipulação #(282)\nVárias outras dependências foram atualizadas",
        "nl": "Node-net-snmp is geüpload om uint32 te verbeteren\nVerschillende andere afhankelijkheid is geüpload",
        "fr": "Node-net-snmp a été mis à jour pour améliorer la manipulation uint32 #(282)\nPlusieurs autres dépendances ont été mises à jour",
        "it": "Node-net-snmp è stato aggiornato per migliorare la gestione uint32 #(282)\nSono state aggiornate diverse altre dipendenze",
        "es": "Node-net-snmp ha sido actualizado para mejorar el manejo uint32 #(282)\nSe han actualizado otras dependencias",
        "pl": "Node-net-snmp został zaktualizowany w celu poprawy obsługi #(282)\nNiektóre inne zależności zostały zaktualizowane",
        "uk": "#(282)\nБуло оновлено кілька інших залежностей",
        "zh-cn": "已经更新了用于改进Suint32处理第(2)82号的网上经验。\n已更新了其他一些依赖性"
      },
      "2.4.10": {
        "en": "Another typo at error output has been fixed",
        "de": "Ein weiterer Tippfehler bei der Fehlerausgabe wurde behoben",
        "ru": "Еще одна опечатка при выходе ошибки была исправлена",
        "pt": "Outro tipo na saída de erro foi corrigido",
        "nl": "Nog een typo bij fouten is gemaakt",
        "fr": "Une autre typo à la sortie d'erreur a été corrigée",
        "it": "Un altro tipo di errore è stato risolto",
        "es": "Se ha fijado otro tipo de salida de error",
        "pl": "Inna typacja na wyjściu błędów została naprawiona",
        "uk": "Ще один тип на виході помилки було виправлено",
        "zh-cn": "另一个错误产出的类型是固定的。"
      },
      "2.4.9": {
        "en": "An option to disable closing of reader session in case of an error has been added.\nLogging in case of errors hase been enhanced when debug log enabled.",
        "de": "Es wurde eine Möglichkeit hinzugefügt, das Schließen der Lesesitzung bei einem Fehler zu deaktivieren.\nDas Logging bei Fehlern wurde verbessert, wenn das Debug-Log aktiviert ist.",
        "ru": "Добавлена возможность отключить закрытие читателя в случае ошибки.\nЗапись в случае ошибок была улучшена при разрешении отладки.",
        "pt": "Uma opção para desativar o fechamento da sessão do leitor no caso de um erro foi adicionado.\nLogging em caso de erros foi aprimorado quando o log de depuração ativado.",
        "nl": "Een optie om het sluiten van de lezersessie uit te schakelen in geval van een fout is toegevoegd.\nIn het geval van fouten is verbeterd als debug log in staat was.",
        "fr": "Une option pour désactiver la fermeture de la session de lecteur en cas d'erreur a été ajoutée.\nL'enregistrement en cas d'erreur a été amélioré lorsque le journal de débogage a été activé.",
        "it": "È stata aggiunta un'opzione per disabilitare la chiusura della sessione del lettore in caso di errore.\nLa registrazione in caso di errori è stata migliorata quando il registro di debug è abilitato.",
        "es": "Se ha añadido una opción para desactivar el cierre de la sesión de lectores en caso de error.\nLogging in case of errors hase been enhanced when debug log enabled.",
        "pl": "Dodano możliwość zamknięcia sesji czytelnika w przypadku błędu.\nUmożliwia to, że błędy zostały poprawione, gdy logowanie debugowe umożliwiało.",
        "uk": "Додана можливість відключити закриття сеансу зчитувача при похибці помилки.\nУ разі виникнення помилок було розширено при ввімкненні з'єднання.",
        "zh-cn": "在出现错误的情况下,添加了一种可更改读者届会的备选办法。.\n出现错误时,由于黑暗的缘故,加重了损失。."
      },
      "2.4.8": {
        "en": "fixed: UDP ports got lost during error handling (#282)\nfixed: Incorrect toString() syntax caused several issues, i.e. missing error output (#283)\nDependencies have been updated",
        "de": "behoben: UDP-Ports gingen während einer Fehlerbehandlung verloren (#282)\nbehoben: Falsche toString() Syntax verursachte mehrere Probleme, z.B. fehlende Fehlerausgaben (#283)\nAbhängigkeiten wurden aktualisiert",
        "ru": "исправлено: UDP порты потеряли при обработке ошибок #(282)\nисправлено: Неправильный кString)( синтаксис вызвал несколько проблем, т.е. отсутствует ошибка вывода #(283)\nВ зависимости были обновлены",
        "pt": "corrigido: As portas UDP foram perdidas durante o manuseio de erros #(282)\ncorrigido: Incorreto toString)( sintaxe causou vários problemas, ou seja, falta de saída de erro #(283)\nAs dependências foram atualizadas",
        "nl": "uDP havens zijn verdwaald tijdens de fout\nincorrect toString ( syntax veroorzaakte verschillende problemen, ik miste fouten uitput ♪\nAfhankelijkheid",
        "fr": "fixes: les ports UDP ont été perdus lors de la manipulation d'erreur #(282)\ncorrigé: Incorrect toString)( syntaxe causée plusieurs problèmes, c.-à-d. sortie d'erreur manquante #(283)\nLes dépendances ont été mises à jour",
        "it": "fisso: le porte UDP si sono perse durante la gestione degli errori #(282)\nfisso: non corretto toString)( la sintassi ha causato diversi problemi, cioè l'uscita di errore mancante #(283)\nLe dipendenze sono state aggiornate",
        "es": "fijo: los puertos UDP se perdieron durante el manejo de errores #(282)\nfijo: Incorrect toString)( Syntax causó varios problemas, es decir, falta de salida de error #(283)\nSe han actualizado las dependencias",
        "pl": "uDP straciła w wyniku przetargu na błędy\nstosowana: Incorrect toString (String)(składnia spowodowała kilka problemów, tzn. brak błędu wyjściowego #(283)\nZależności zostały zaktualizowane",
        "uk": "виправлено: УДП порти втратили під час обробки помилок #(282)\nвиправлено: Невірно доString)( синтаксис викликало кілька питань, тобто відсутній вихід помилок #(283)\nОновлено залежність",
        "zh-cn": "固定:在错误处理第(2)82号错误时,联发办港口损失\n固定:不正确地进入(综合税)造成若干问题,即失踪产出(283)\n已更新了属地"
      }
    },
    "titleLang": {
      "en": "SNMP",
      "de": "SNMP",
      "ru": "SNMP",
      "pt": "SNMP",
      "nl": "SNMP",
      "fr": "SNMP",
      "it": "SNMP",
      "es": "SNMP",
      "pl": "SNMP",
      "zh-cn": "SNMP",
      "uk": "SNMP"
    },
    "desc": {
      "en": "Allows to poll SNMP OIDs in ioBroker",
      "de": "Ermöglicht das Polling von SNMP Objekten im ioBroker",
      "ru": "Позволяет считывать SNPM объекты по OID в ioBroker",
      "pt": "ioBroker SNMP-OID Adapter",
      "fr": "ioBroker SNMP-OID Adapter",
      "nl": "ioBroker SNMP-OID Adapter",
      "it": "Consente di eseguire il polling degli OID SNMP in ioBroker",
      "es": "Permite sondear los OID de SNMP en ioBroker",
      "pl": "Umożliwia odpytywanie identyfikatorów SNMP OID w ioBroker",
      "zh-cn": "允许在 ioBroker 中轮询 SNMP OID",
      "uk": "Дозволяє опитувати SNMP OID в ioBroker"
    },
    "licenseInformation": {
      "license": "MIT",
      "type": "free"
    },
    "platform": "Javascript/Node.js",
    "icon": "snmp.png",
    "extIcon": "https://raw.githubusercontent.com/iobroker-community-adapters/ioBroker.snmp/master/admin/snmp.png",
    "keywords": [
      "SNMP-OID"
    ],
    "readme": "https://github.com/mcm1957/ioBroker.snmp/blob/master/README.md",
    "loglevel": "info",
    "tier": 2,
    "mode": "daemon",
    "type": "infrastructure",
    "connectionType": "local",
    "dataSource": "poll",
    "compact": true,
    "authors": [
      {
        "name": "Marcolotti",
        "email": "info@ct-j.de"
      },
      {
        "name": "mcm1957",
        "email": "mcm57@gmx.at"
      }
    ],
    "adminUI": {
      "config": "json"
    },
    "stopBeforeUpdate": "true",
    "plugins": {
      "sentry": {
        "dsn": "https://621ac710b70445f8b170cbb783045988@sentry.iobroker.net/181"
      }
    },
    "dependencies": [
      {
        "js-controller": ">=5.0.0"
      }
    ],
    "globalDependencies": [
      {
        "admin": ">=5.1.28"
      }
    ],
    "messages": [
      {
        "condition": {
          "operand": "and",
          "rules": [
            "oldVersion<2.0.0",
            "newVersion>=2.0.0"
          ]
        },
        "title": {
          "en": "Important notice!",
          "de": "Wichtiger Hinweis!",
          "ru": "Важное замечание!",
          "pt": "Notícia importante!",
          "nl": "Belangrijke mededeling!",
          "fr": "Avis important!",
          "it": "Avviso IMPORTANTE!",
          "es": "Noticia importante!",
          "pl": "Ważna uwaga!",
          "zh-cn": "重要通知!",
          "uk": "Важливе повідомлення!"
        },
        "text": {
          "en": "Configuration data has been changed for version 2.0.0 (and newer). Installation will try to migrate data but there is a chance that this fails. Please ensure that you have a backup and a external documention of your configuration before upgrading to version 2.0.0 or newer.",
          "de": "Konfigurationsdaten wurden für Version 2.0.0 (und neuer) geändert. Die Installation wird versuchen, Daten zu migrieren, aber es gibt eine Chance, dass dies versagt. Bitte stellen Sie sicher, dass Sie ein Backup und eine externe Dokumentation Ihrer Konfiguration vor dem Upgrade auf Version 2.0.0 oder neuer haben.",
          "ru": "Данные конфигурации были изменены для версии 2.0.0 (и новее). Установка будет пытаться перенести данные, но есть шанс, что это не работает. Пожалуйста, убедитесь, что у вас есть резервное копирование и внешний документирование вашей конфигурации перед обновлением до версии 2.0.0 или новее.",
          "pt": "Os dados de configuração foram alterados para a versão 2.0.0 (e mais recente). A instalação tentará migrar dados, mas há uma chance de que isso falha. Certifique-se de ter um backup e uma documentação externa de sua configuração antes de atualizar para a versão 2.0.0 ou mais recente.",
          "nl": "Vermoedende data is veranderd voor versie 2.0. Installatie zal proberen data te verminderen maar er is een kans dat dit mislukt. Zorg ervoor dat je een back-up hebt en een externe documentie van je zelfvertrouwen voordat je verstoort naar versie 2.0 of nieuwer.",
          "fr": "Les données de configuration ont été modifiées pour la version 2.0.0 (et plus récente). L'installation tentera de migrer les données, mais il y a une chance que cela échoue. Assurez-vous d'avoir une sauvegarde et une documentation externe de votre configuration avant de passer à la version 2.0.0 ou plus récente.",
          "it": "I dati di configurazione sono stati modificati per la versione 2.0.0 (e più recente). L'installazione cercherà di migrare i dati, ma c'è la possibilità che questo fallisca. Si prega di assicurarsi di avere un backup e un documento esterno della configurazione prima di aggiornare alla versione 2.0.0 o più recente.",
          "es": "Los datos de configuración se han modificado para la versión 2.0.0 (y más reciente). La instalación intentará migrar datos pero hay una posibilidad de que esto falle. Por favor, asegúrese de tener una copia de seguridad y una documentación externa de su configuración antes de actualizar a la versión 2.0.0 o más reciente.",
          "pl": "Dane konfiguracyjne zostały zmienione na wersję 2.0.0 (i nowszą). Instalacja stara się wyemitować dane, ale istnieje szansa, że to się nie udaje. Zapewniajcie, że mamy backup i zewnętrzną dokumentację twojej wersji 2.0.0 lub nowszego.",
          "zh-cn": "对2.0.0版本(和新版)的合并数据进行了修改。 绝大部分将试图迁移数据,但有失败的机会。 请确保在更新至2.0.0或新版之前,对你的配置进行反馈和外部记录。.",
          "uk": "Дані конфігурації змінено для версії 2.0.0 (і новішої). Інсталяція спробує перенести дані, але існує ймовірність, що це не вдасться. Переконайтеся, що у вас є резервна копія та зовнішня документація вашої конфігурації перед оновленням до версії 2.0.0 або новішої."
        },
        "link": "https://github.com/iobroker-community-adapters/ioBroker.snmp#changelog",
        "level": "warn",
        "linkText": {
          "en": "Changelog",
          "de": "Änderungsprotokoll",
          "ru": "Список изменений",
          "pt": "Registro de alterações",
          "nl": "Wijzigingslog",
          "fr": "Journal des modifications",
          "it": "Registro delle modifiche",
          "es": "registro de cambios",
          "pl": "Dziennik zmian",
          "zh-cn": "变更日志",
          "uk": "Журнал змін"
        },
        "buttons": [
          "agree",
          "cancel"
        ]
      },
      {
        "condition": {
          "operand": "and",
          "rules": [
            "oldVersion<1.0.0",
            "newVersion>=1.0.0"
          ]
        },
        "title": {
          "en": "Important notice!",
          "de": "Wichtiger Hinweis!",
          "ru": "Важное замечание!",
          "pt": "Notícia importante!",
          "nl": "Belangrijke mededeling!",
          "fr": "Avis important!",
          "it": "Avviso IMPORTANTE!",
          "es": "Noticia importante!",
          "pl": "Ważna uwaga!",
          "zh-cn": "重要通知!",
          "uk": "Важливе повідомлення!"
        },
        "text": {
          "en": "Version 1.0.0 will change the names of objects containing special characters like \\\".\\\", \\\"-\\\" or spaces! Please delete the old objects manually if needed.",
          "de": "Version 1.0.0 ändert die Namen von Objekten, die spezielle Zeichen wie \\\"\\\", \\\"-\\\" oder Leerzeichen enthalten! Bitte löschen Sie die alten Objekte bei Bedarf manuell.",
          "ru": "Версия 1.0.0 изменит имена объектов, содержащих специальные символы, такие как \\\".\\\", \\\"-\\\" или пространства! Пожалуйста, удалите старые объекты вручную, если это необходимо.",
          "pt": "A versão 1.0.0 mudará os nomes de objetos contendo caracteres especiais como \\\".\\\", \\\"-\\\" ou espaços! Por favor, exclua os objetos antigos manualmente, se necessário.",
          "nl": "Version 1.0.0 zal de namen veranderen van objecten met speciale personages zoals . Verwijder de oude objecten handmatig als het nodig is.",
          "fr": "La version 1.0.0 va changer les noms des objets contenant des caractères spéciaux comme \\\".\\\", \\\"-\\\" ou des espaces! Veuillez supprimer les anciens objets manuellement si nécessaire.",
          "it": "La versione 1.0.0 cambierà i nomi di oggetti contenenti caratteri speciali come \\\", \\\"-\\\" o spazi! Si prega di eliminare i vecchi oggetti manualmente se necessario.",
          "es": "Versión 1.0.0 cambiará los nombres de objetos que contienen caracteres especiales como \\\".\\\", \\\"-\\\" o espacios! Por favor, borre los viejos objetos manualmente si es necesario.",
          "pl": "Wersja 1.0.0 zmienia nazwę obiektów o specjalnych postaciach, takich jak: \\, \\ lub przestrzeni! Okazuje się, że stare obiekty ręcznie będą potrzebne.",
          "zh-cn": "Version1.0.0将改变含有特殊特性的物体的名称,如乙型号、乙型号或空间。 请在必要时删除旧物体。.",
          "uk": "Версія 1.0.0 змінить назви об'єктів, які містять спеціальні символи, такі як \\\".\\\", \\\"-\\\" або пробіли! За потреби видаліть старі об’єкти вручну."
        },
        "link": "https://github.com/iobroker-community-adapters/ioBroker.snmp#changelog",
        "level": "warn",
        "linkText": {
          "en": "Changelog",
          "de": "Änderungsprotokoll",
          "ru": "Список изменений",
          "pt": "Registro de alterações",
          "nl": "Wijzigingslog",
          "fr": "Journal des modifications",
          "it": "Registro delle modifiche",
          "es": "registro de cambios",
          "pl": "Dziennik zmian",
          "zh-cn": "变更日志",
          "uk": "Журнал змін"
        },
        "buttons": [
          "agree",
          "cancel"
        ]
      }
    ]
  },
  "native": {},
  "objects": [],
  "instanceObjects": [
    {
      "_id": "info",
      "type": "channel",
      "common": {
        "name": "Information"
      },
      "native": {}
    },
    {
      "_id": "info.connection",
      "type": "state",
      "common": {
        "role": "indicator.connected",
        "name": "If connected to device",
        "type": "boolean",
        "read": true,
        "write": false,
        "def": false
      },
      "native": {}
    }
  ]
}
