{
  "common": {
    "name": "snmp",
    "version": "2.0.0-beta.2",
    "news": {
      "2.0.0-beta.2": {
        "en": "* IMPORTANT: This release will change the configuration structures!\n  Please backup your configuration before starting the installation.\n  The Installation will try to convert the old configuration - but it is not guaranteed to succeed in all cases. \n* Many parts of the code have been rewriten\n* The adapter now uses the admin5 interface\n* Timer values can now be set differently per device (#105)\n* Changing the order of configuration entries does no longer destroy data (#15)\n* Stateobjects for devices can now be named. The old behavior is available as an option.\n* Known restriction: currently only SNMP V1 is supported.",
        "de": "* WICHTIG: Diese Veröffentlichung wird die Konfigurationsstrukturen ändern!\nBitte sichern Sie Ihre Konfiguration, bevor Sie die Installation starten.\nDie Installation wird versuchen, die alte Konfiguration umzuwandeln - aber in allen Fällen ist es nicht garantiert, erfolgreich zu sein.\n* Viele Teile des Codes wurden neu geschrieben\n* Der Adapter nutzt nun die Admin5-Schnittstelle\n* Timer-Werte können nun je Gerät unterschiedlich eingestellt werden (#105)\n* Die Änderung der Reihenfolge der Konfigurationseinträge zerstört keine Daten mehr (#15)\n* Stateobjects für Geräte können jetzt benannt werden. Das alte Verhalten ist als Option verfügbar.\n* Bekannte Einschränkung: derzeit wird nur SNMP V1 unterstützt.",
        "ru": "* ВАЖНО: Этот релиз изменит структуры конфигурации!\nПожалуйста, резервируйте конфигурацию перед запуском установки.\nУстановка попытается конвертировать старую конфигурацию - но она не гарантирована для достижения успеха во всех случаях.\n* Много частей кода были rewriten\n* Теперь адаптер использует интерфейс admin5\n* Значения таймера теперь могут быть установлены по-разному на устройство (#105)\n* Изменение порядка записи конфигурации больше не уничтожает данные (#15)\n* Stateobjects для устройств теперь можно назвать. Старое поведение доступно как вариант.\n* Известное ограничение: в настоящее время поддерживается только SNMP V1.",
        "pt": "* IMPORTANTE: Esta versão irá alterar as estruturas de configuração!\nFaça backup da configuração antes de iniciar a instalação.\nA instalação tentará converter a configuração antiga - mas não é garantido para ter sucesso em todos os casos.\n* Muitas partes do código foram reescrevedas\n* O adaptador agora usa a interface admin5\n* Os valores do temporizador agora podem ser definidos de forma diferente por dispositivo (#105)\n* Alterar a ordem de entradas de configuração não destrói mais dados (#15)\n* Os objetos estatais para dispositivos podem agora ser nomeados. O comportamento antigo está disponível como opção.\n* Limitação conhecida: atualmente apenas SNMP V1 é suportado.",
        "nl": "Deze vrijlating zal de zelfverzekeringsstructuur veranderen!\nVersterking voor de installatie.\nDe installatie zal proberen de oude zelfvertrouwen te bekeren, maar het is niet gegarandeerd te slagen in alle gevallen.\n♪ Veel delen van de code zijn herschreven\n♪ De adapter gebruikt nu de administratie interface\n♪ Timer waarden kunnen nu anders worden opgezet\n♪ Changing the order of configuration intries don't vernietigen data (15)\n♪ Stateobjects for apparatuur kan nu genoemd worden. Het oude gedrag is beschikbaar als een optie.\nOp dit moment is alleen SNMP V1 ondersteund.",
        "fr": "* IMPORTANT: Cette version changera les structures de configuration!\nVeuillez sauvegarder votre configuration avant de démarrer l'installation.\nL'Installation tentera de convertir l'ancienne configuration - mais il n'est pas garanti de réussir dans tous les cas.\n* De nombreuses parties du code ont été réécrites\n* L'adaptateur utilise maintenant l'interface admin5\n* Les valeurs temporelles peuvent maintenant être définies différemment selon le dispositif (#105)\n* Changer l'ordre des entrées de configuration ne détruit plus les données (#15)\n* Les objets d'état pour les appareils peuvent maintenant être nommés. L'ancien comportement est disponible en option.\n* Limite connue: actuellement seul SNMP V1 est supporté.",
        "it": "* IMPORTANTE: Questa versione cambierà le strutture di configurazione!\nSi prega di eseguire il backup della configurazione prima di avviare l'installazione.\nL'installazione cercherà di convertire la vecchia configurazione - ma non è garantito avere successo in tutti i casi.\n# Molte parti del codice sono state riscritte\n# L'adattatore ora utilizza l'interfaccia di admin5\n* I valori del timer possono ora essere impostati in modo diverso per dispositivo (#105)\n* Cambiare l'ordine delle voci di configurazione non distrugge più i dati (#15)\n* Gli oggetti di stato per i dispositivi possono ora essere nominati. Il vecchio comportamento è disponibile come opzione.\n* Limite noto: attualmente solo SNMP V1 è supportato.",
        "es": "* IMPORTANTE: ¡Esta versión cambiará las estructuras de configuración!\nPor favor, respalde su configuración antes de iniciar la instalación.\nLa instalación intentará convertir la antigua configuración - pero no está garantizada a tener éxito en todos los casos.\n* Muchas partes del código han sido reescribidas\n* El adaptador ahora utiliza la interfaz admin5\n* Los valores del temporizador se pueden configurar de forma diferente por dispositivo (#105)\n* Cambiar el orden de las entradas de configuración ya no destruye datos (#15)\n* Los objetivos de los dispositivos pueden ser nombrados ahora. El comportamiento antiguo está disponible como opción.\n* Restricción conocida: actualmente sólo se admite SNMP V1.",
        "pl": "* IMPORTANT: Wydanie zmieni strukturę konfiguracji!\nPozwólcie na tył przed rozpoczęciem instalacji.\nInstalacja będzie starała się przekształcić starą konfigurację, ale nie jest zagwarantowana w żadnych przypadkach.\n* Wiele fragmentów kodu zostało przepisanych\n* Administrator korzysta z interfejsu admin5\nWartość * Timer może być ustawiona w różny sposób (#105)\n* Zmianowanie kolejności konfiguracyjnych nie niszcza danych (#15)\n* Narządy dla urządzeń mogą być obecnie nazywane. Stare zachowanie jest dostępne jako opcja.\n* Znana restrykcja: obecnie tylko SNMP V1.",
        "zh-cn": "* IMPORTANT:这一释放将改变结构!\n请在开始安装之前支持你的配置。.\n乱葬将设法改变旧的格局,但不能保证在所有情况下取得成功。.\n* A/64/50。 守则的许多部分已经改写。\n* A/64/50。 适应者现在使用了特明5个接口。\n* 时间数值现在可按不同类型确定(第105号)。\n* 更改组合物品的顺序不再销毁数据(第15号)。\n* 目前可以指定国家对装置的控制。 旧的行为可以作为一种选择。.\n* Known限制:目前只有SNMP V1得到支持。."
      },
      "2.0.0-beta.1": {
        "en": "* IMPORTANT: This release will change the configuration structures!\n  Please backup your configuration before starting the installation.\n  The Installation will try to convert the old configuration - but it is not guaranteed to succeed in all cases. \n* Many parts of the code have been rewriten\n* The adapter now uses the admin5 interface\n* Timer values can now be set differently per device (#105)\n* Changing the order of configuration entries does no longer destroy data (#15)\n* Stateobjects for devices can now be named. The old behavior is available as an option.",
        "de": "* WICHTIG: Diese Veröffentlichung wird die Konfigurationsstrukturen ändern!\nBitte sichern Sie Ihre Konfiguration, bevor Sie die Installation starten.\nDie Installation wird versuchen, die alte Konfiguration umzuwandeln - aber in allen Fällen ist es nicht garantiert, erfolgreich zu sein.\n* Viele Teile des Codes wurden neu geschrieben\n* Der Adapter nutzt nun die Admin5-Schnittstelle\n* Timer-Werte können nun je Gerät unterschiedlich eingestellt werden (#105)\n* Die Änderung der Reihenfolge der Konfigurationseinträge zerstört keine Daten mehr (#15)\n* Stateobjects für Geräte können jetzt benannt werden. Das alte Verhalten ist als Option verfügbar.",
        "ru": "* ВАЖНО: Этот релиз изменит структуры конфигурации!\nПожалуйста, резервируйте конфигурацию перед запуском установки.\nУстановка попытается конвертировать старую конфигурацию - но она не гарантирована для достижения успеха во всех случаях.\n* Много частей кода были rewriten\n* Теперь адаптер использует интерфейс admin5\n* Значения таймера теперь могут быть установлены по-разному на устройство (#105)\n* Изменение порядка записи конфигурации больше не уничтожает данные (#15)\n* Stateobjects для устройств теперь можно назвать. Старое поведение доступно как вариант.",
        "pt": "* IMPORTANTE: Esta versão irá alterar as estruturas de configuração!\nFaça backup da configuração antes de iniciar a instalação.\nA instalação tentará converter a configuração antiga - mas não é garantido para ter sucesso em todos os casos.\n* Muitas partes do código foram reescrevedas\n* O adaptador agora usa a interface admin5\n* Os valores do temporizador agora podem ser definidos de forma diferente por dispositivo (#105)\n* Alterar a ordem de entradas de configuração não destrói mais dados (#15)\n* Os objetos estatais para dispositivos podem agora ser nomeados. O comportamento antigo está disponível como opção.",
        "nl": "Deze vrijlating zal de zelfverzekeringsstructuur veranderen!\nVersterking voor de installatie.\nDe installatie zal proberen de oude zelfvertrouwen te bekeren, maar het is niet gegarandeerd te slagen in alle gevallen.\n♪ Veel delen van de code zijn herschreven\n♪ De adapter gebruikt nu de administratie interface\n♪ Timer waarden kunnen nu anders worden opgezet\n♪ Changing the order of configuration intries don't vernietigen data (15)\n♪ Stateobjects for apparatuur kan nu genoemd worden. Het oude gedrag is beschikbaar als een optie.",
        "fr": "* IMPORTANT: Cette version changera les structures de configuration!\nVeuillez sauvegarder votre configuration avant de démarrer l'installation.\nL'Installation tentera de convertir l'ancienne configuration - mais il n'est pas garanti de réussir dans tous les cas.\n* De nombreuses parties du code ont été réécrites\n* L'adaptateur utilise maintenant l'interface admin5\n* Les valeurs temporelles peuvent maintenant être définies différemment selon le dispositif (#105)\n* Changer l'ordre des entrées de configuration ne détruit plus les données (#15)\n* Les objets d'état pour les appareils peuvent maintenant être nommés. L'ancien comportement est disponible en option.",
        "it": "* IMPORTANTE: Questa versione cambierà le strutture di configurazione!\nSi prega di eseguire il backup della configurazione prima di avviare l'installazione.\nL'installazione cercherà di convertire la vecchia configurazione - ma non è garantito avere successo in tutti i casi.\n# Molte parti del codice sono state riscritte\n# L'adattatore ora utilizza l'interfaccia di admin5\n* I valori del timer possono ora essere impostati in modo diverso per dispositivo (#105)\n* Cambiare l'ordine delle voci di configurazione non distrugge più i dati (#15)\n* Gli oggetti di stato per i dispositivi possono ora essere nominati. Il vecchio comportamento è disponibile come opzione.",
        "es": "* IMPORTANTE: ¡Esta versión cambiará las estructuras de configuración!\nPor favor, respalde su configuración antes de iniciar la instalación.\nLa instalación intentará convertir la antigua configuración - pero no está garantizada a tener éxito en todos los casos.\n* Muchas partes del código han sido reescribidas\n* El adaptador ahora utiliza la interfaz admin5\n* Los valores del temporizador se pueden configurar de forma diferente por dispositivo (#105)\n* Cambiar el orden de las entradas de configuración ya no destruye datos (#15)\n* Los objetivos de los dispositivos pueden ser nombrados ahora. El comportamiento antiguo está disponible como opción.",
        "pl": "* IMPORTANT: Wydanie zmieni strukturę konfiguracji!\nPozwólcie na tył przed rozpoczęciem instalacji.\nInstalacja będzie starała się przekształcić starą konfigurację, ale nie jest zagwarantowana w żadnych przypadkach.\n* Wiele fragmentów kodu zostało przepisanych\n* Administrator korzysta z interfejsu admin5\nWartość * Timer może być ustawiona w różny sposób (#105)\n* Zmianowanie kolejności konfiguracyjnych nie niszcza danych (#15)\n* Narządy dla urządzeń mogą być obecnie nazywane. Stare zachowanie jest dostępne jako opcja.",
        "zh-cn": "* IMPORTANT:这一释放将改变结构!\n请在开始安装之前支持你的配置。.\n乱葬将设法改变旧的格局,但不能保证在所有情况下取得成功。.\n* A/64/50。 守则的许多部分已经改写。\n* A/64/50。 适应者现在使用了特明5个接口。\n* 时间数值现在可按不同类型确定(第105号)。\n* 更改组合物品的顺序不再销毁数据(第15号)。\n* 目前可以指定国家对装置的控制。 旧的行为可以作为一种选择。."
      },
      "2.0.0-beta.0": {
        "en": "* IMPORTANT: This release will change configuration structures!\n  Please backup your configuration before starting the installation.\n  Installation will try to convert old configuration - but its not guaranteed to succeed in all cases. \n* adaptercode has undergone a major rewrite\n* adapter now uses admin5 interface\n* timer values can be set differently per device (issue #105)\n* reordering configuration entries does no longer destroy data (issue #15)\n* state objects for devices can now be named. Old behavior using the ip address is available as an option.",
        "de": "* WICHTIG: Diese Version wird Konfigurationsstrukturen ändern!\n  Bitte sichern Sie Ihre Konfiguration, bevor Sie mit der Installation beginnen.\n  Die Installation wird versuchen, die alte Konfiguration zu konvertieren - aber es ist nicht garantiert, dass sie in allen Fällen erfolgreich ist.\n* Adaptercode wurde grundlegend überarbeitet\n* Der Adapter verwendet jetzt die admin5-Schnittstelle\n* Timerwerte können pro Gerät unterschiedlich eingestellt werden (issue #105)\n* Das Neuordnen von Konfigurationseinträgen zerstört keine Daten mehr (Problem Nr. 15)\n* Zustandsobjekte für Geräte können jetzt benannt werden. Das alte Verhalten unter Verwendung der IP-Adresse ist optional verfügbar.",
        "ru": "* ВАЖНО: В этом выпуске будут изменены структуры конфигурации!\n  Сделайте резервную копию вашей конфигурации перед началом установки.\n  Установка попытается преобразовать старую конфигурацию, но успех не гарантируется во всех случаях.\n* код адаптера был сильно переписан\n* адаптер теперь использует интерфейс admin5\n* значения таймера могут быть установлены по-разному для каждого устройства (issue #105)\n* изменение порядка записей конфигурации больше не уничтожает данные (проблема №15)\n* объекты состояния для устройств теперь могут быть названы. Старое поведение с использованием IP-адреса доступно в качестве опции.",
        "pt": "* IMPORTANTE: Esta versão irá alterar as estruturas de configuração!\n  Faça backup de sua configuração antes de iniciar a instalação.\n  A instalação tentará converter a configuração antiga - mas não há garantia de sucesso em todos os casos.\n* adaptercode passou por uma grande reescrita\n* o adaptador agora usa a interface admin5\n* os valores do temporizador podem ser definidos de forma diferente por dispositivo (edição nº 105)\n* reordenar as entradas de configuração não destrói mais os dados (questão nº 15)\n* objetos de estado para dispositivos agora podem ser nomeados. O comportamento antigo usando o endereço IP está disponível como opção.",
        "nl": "* BELANGRIJK: deze release verandert de configuratiestructuren!\n  Maak een back-up van uw configuratie voordat u met de installatie begint.\n  De installatie zal proberen de oude configuratie om te zetten - maar het is niet gegarandeerd dat dit in alle gevallen lukt.\n* adaptercode heeft een grote herschrijving ondergaan\n* adapter gebruikt nu admin5-interface\n* timerwaarden kunnen per apparaat anders worden ingesteld (uitgave #105)\n* het opnieuw ordenen van configuratie-items vernietigt niet langer gegevens (probleem #15)\n* statusobjecten voor apparaten kunnen nu een naam krijgen. Oud gedrag waarbij het ip-adres wordt gebruikt, is als optie beschikbaar.",
        "fr": "* IMPORTANT : Cette version modifiera les structures de configuration !\n  Veuillez sauvegarder votre configuration avant de commencer l'installation.\n  L'installation tentera de convertir l'ancienne configuration - mais il n'est pas garanti qu'elle réussisse dans tous les cas.\n* adaptercode a subi une réécriture majeure\n* L'adaptateur utilise maintenant l'interface admin5\n* les valeurs de minuterie peuvent être définies différemment par appareil (problème #105)\n* la réorganisation des entrées de configuration ne détruit plus les données (problème #15)\n* Les objets d'état des appareils peuvent désormais être nommés. L'ancien comportement utilisant l'adresse IP est disponible en option.",
        "it": "* IMPORTANTE: questa versione cambierà le strutture di configurazione!\n  Eseguire il backup della configurazione prima di avviare l'installazione.\n  L'installazione tenterà di convertire la vecchia configurazione, ma non è garantito che riesca in tutti i casi.\n* adaptercode ha subito un'importante riscrittura\n* l'adattatore ora utilizza l'interfaccia admin5\n* i valori del timer possono essere impostati in modo diverso per dispositivo (problema n. 105)\n* il riordino delle voci di configurazione non distrugge più i dati (problema n. 15)\n* ora è possibile assegnare un nome agli oggetti di stato per i dispositivi. Il vecchio comportamento che utilizza l'indirizzo IP è disponibile come opzione.",
        "es": "* IMPORTANTE: ¡Esta versión cambiará las estructuras de configuración!\n  Haga una copia de seguridad de su configuración antes de comenzar la instalación.\n  La instalación intentará convertir la configuración anterior, pero no se garantiza que tenga éxito en todos los casos.\n* el código del adaptador ha sufrido una reescritura importante\n* el adaptador ahora usa la interfaz admin5\n* los valores del temporizador se pueden configurar de manera diferente según el dispositivo (problema #105)\n* reordenar las entradas de configuración ya no destruye los datos (problema #15)\n* Ahora se pueden nombrar objetos de estado para dispositivos. El antiguo comportamiento con la dirección IP está disponible como opción.",
        "pl": "* WAŻNE: Ta wersja zmieni struktury konfiguracyjne!\n  Przed rozpoczęciem instalacji wykonaj kopię zapasową konfiguracji.\n  Instalacja będzie próbowała przekonwertować starą konfigurację — ale nie we wszystkich przypadkach gwarantuje to powodzenie.\n* kod adaptera przeszedł gruntowną przeróbkę\n* adapter używa teraz interfejsu administratora\n* wartości timera można ustawić inaczej w zależności od urządzenia (wydanie #105)\n* zmiana kolejności wpisów konfiguracyjnych nie niszczy już danych (problem #15)\n* Można teraz nazywać obiekty stanu dla urządzeń. Opcjonalnie dostępne jest stare zachowanie przy użyciu adresu IP.",
        "zh-cn": "* 重要提示：此版本将更改配置结构！\n  请在开始安装之前备份您的配置。\n  安装将尝试转换旧配置 - 但不能保证在所有情况下都能成功。\n* 适配器代码已经过重大改写\n* 适配器现在使用 admin5 接口\n* 每个设备可以设置不同的计时器值（问题 #105）\n* 重新排序配置条目不再破坏数据（问题 #15）\n* 现在可以命名设备的状态对象。使用 ip 地址的旧行为可作为选项使用。"
      },
      "1.0.0": {
        "en": "IMPORTANT: This release will change the object structures!!\nreduce latency for update of info.connection \navoid excessive error logs if target is unreachable, optimize logging\nadd additional online at ip base to indicate target is reachable\noutput warning if OIDs specify different communities for one device\nAdd Sentry for crash reporting",
        "de": "WICHTIG: Diese Version wird die Objektstrukturen ändern!!\nLatenzreduzierung für die Aktualisierung von info.connection\nVermeidung von übermäßigen Fehlerprotokollen, falls das Ziel nicht erreichbar ist und Protokollierungoptimierung\nOnline Status der IP-Adresse zur Anzeige der Erreichbarkeit hinzugefügt\nAusgabe einer Warnung, wenn OIDs unterschiedlicher Communities für ein Gerät angeben werden\nSentry für Absturzberichte hinzugefügt",
        "ru": "ВАЖНО: В этом релизе будут изменены структуры объектов!!\nуменьшить задержку для обновления info.connection\nизбегайте избыточных журналов ошибок, если цель недоступна, оптимизируйте ведение журнала\nдобавить дополнительный онлайн на базе ip, чтобы указать, что цель достижима\nвывод предупреждения, если OID указывают разные сообщества для одного устройства\nДобавьте Sentry для отчетов о сбоях",
        "pt": "IMPORTANTE: Esta versão irá alterar as estruturas dos objetos!!\nreduzir a latência para atualização de info.connection\nevite logs de erros excessivos se o destino estiver inacessível, otimize o log\nadicione on-line adicional na base do ip para indicar que o destino é alcançável\naviso de saída se os OIDs especificarem comunidades diferentes para um dispositivo\nAdicionar Sentinela para relatórios de falhas",
        "nl": "BELANGRIJK: Deze release zal de objectstructuren veranderen!!\nverminder latentie voor update van info.connection\nvermijd overmatige foutenlogboeken als het doel onbereikbaar is, optimaliseer de logboekregistratie\nvoeg extra online toe op ip-basis om aan te geven dat het doel bereikbaar is\nuitvoerwaarschuwing als OID's verschillende gemeenschappen specificeren voor één apparaat\nSentry toevoegen voor crashrapportage",
        "fr": "IMPORTANT : Cette version modifiera les structures d'objets !\nréduire la latence pour la mise à jour d'info.connection\néviter les journaux d'erreurs excessifs si la cible est inaccessible, optimiser la journalisation\najouter en ligne supplémentaire à la base IP pour indiquer que la cible est accessible\navertissement de sortie si les OID spécifient différentes communautés pour un appareil\nAjouter Sentry pour les rapports de plantage",
        "it": "IMPORTANTE: questa versione cambierà le strutture degli oggetti!!\nridurre la latenza per l'aggiornamento di info.connection\nevitare log di errori eccessivi se la destinazione non è raggiungibile, ottimizzare la registrazione\naggiungere ulteriore online alla base IP per indicare che l'obiettivo è raggiungibile\navviso di output se gli OID specificano comunità diverse per un dispositivo\nAggiungi Sentinella per la segnalazione degli arresti anomali",
        "es": "IMPORTANTE: ¡Esta versión cambiará las estructuras de los objetos!\nreducir la latencia para la actualización de info.connection\nevitar registros de errores excesivos si el objetivo no es alcanzable, optimizar el registro\nagregue más en línea en la base de ip para indicar que se puede alcanzar el objetivo\nadvertencia de salida si los OID especifican diferentes comunidades para un dispositivo\nAgregar Sentry para informes de fallas",
        "pl": "WAŻNE: Ta wersja zmieni strukturę obiektów!!\nskrócić czas oczekiwania na aktualizację info.connection\nunikaj nadmiernych rejestrów błędów, jeśli cel jest nieosiągalny, zoptymalizuj rejestrowanie\ndodaj dodatkowe online w bazie IP, aby wskazać, że cel jest osiągalny\nostrzeżenie wyjściowe, jeśli OID określają różne społeczności dla jednego urządzenia\nDodaj Sentry do zgłaszania awarii",
        "zh-cn": "重要提示：此版本将更改对象结构！！\n减少更新 info.connection 的延迟\n如果目标不可达，避免过多的错误日志，优化日志记录\n在 ip base 添加额外的在线以指示目标是可达的\n如果 OID 为一台设备指定不同的社区，则输出警告\n添加 Sentry 以进行崩溃报告"
      },
      "0.5.0": {
        "en": "Initial Release",
        "de": "Erstveröffentlichung",
        "ru": "Первый выпуск",
        "pt": "Lançamento inicial",
        "nl": "Eerste uitgave",
        "fr": "Première version",
        "it": "Versione iniziale",
        "es": "Versión inicial",
        "pl": "Pierwsze wydanie",
        "zh-cn": "初始发行"
      }
    },
    "title": "SNMP",
    "titleLang": {
      "en": "SNMP",
      "de": "SNMP",
      "ru": "SNMP",
      "pt": "SNMP",
      "nl": "SNMP",
      "fr": "SNMP",
      "it": "SNMP",
      "es": "SNMP",
      "pl": "SNMP",
      "zh-cn": "SNMP"
    },
    "desc": {
      "en": "Allows to poll SNMP OIDs in ioBroker",
      "de": "Ermöglicht das Polling von SNMP Objekten im ioBroker",
      "ru": "Позволяет считывать SNPM объекты по OID в ioBroker",
      "pt": "ioBroker SNMP-OID Adapter",
      "fr": "ioBroker SNMP-OID Adapter",
      "nl": "ioBroker SNMP-OID Adapter",
      "it": "Consente di eseguire il polling degli OID SNMP in ioBroker",
      "es": "Permite sondear los OID de SNMP en ioBroker",
      "pl": "Umożliwia odpytywanie identyfikatorów SNMP OID w ioBroker",
      "zh-cn": "允许在 ioBroker 中轮询 SNMP OID"
    },
    "license": "MIT",
    "platform": "Javascript/Node.js",
    "icon": "snmp.png",
    "extIcon": "https://raw.githubusercontent.com/iobroker-community-adapters/ioBroker.snmp/master/admin/snmp.png",
    "keywords": [
      "SNMP-OID"
    ],
    "readme": "https://github.com/iobroker-community-adapters/ioBroker.snmp/blob/master/README.md",
    "loglevel": "info",
    "mode": "daemon",
    "type": "infrastructure",
    "connectionType": "local",
    "dataSource": "poll",
    "authors": [
      {
        "name": "Marcolotti",
        "email": "info@ct-j.de"
      },
      {
        "name": "mcm1957",
        "email": "mcm57@gmx.at"
      }
    ],
    "adminUI": {
      "config": "json"
    },
    "stopBeforeUpdate": "true",
    "plugins": {
      "sentry": {
        "dsn": "https://621ac710b70445f8b170cbb783045988@sentry.iobroker.net/181"
      }
    },
    "globalDependencies": [
      {
        "admin": ">=5.1.28"
      }
    ],
    "dependencies": [
      {
        "js-controller": ">=2.0.0"
      }
    ],
    "messages": [
      {
        "condition": {
          "operand": "and",
          "rules": [
            "oldVersion<2.0.0",
            "newVersion>=2.0.0"
          ]
        },
        "title": {
          "en": "Important notice!",
          "de": "Wichtiger Hinweis!",
          "ru": "Важное замечание!",
          "pt": "Notícia importante!",
          "nl": "Belangrijke mededeling!",
          "fr": "Avis important!",
          "it": "Avviso IMPORTANTE!",
          "es": "Noticia importante!",
          "pl": "Ważna uwaga!",
          "zh-cn": "重要通知!"
        },
        "text": {
          "en": "Version 1.0.0 will change the names of objects containing special characters like \\\".\\\", \\\"-\\\" or spaces! Please delete the old objects manually if needed.\nConfiguration data has been changed for version 2.0.0 (and newer). Installation will try to migrate data but there is a chance that this fails. Please ensure that you have a backup and a external documention of your configuration before upgrading to version 2.0.0 or newer.",
          "de": "Version 1.0.0 ändert die Namen von Objekten, die spezielle Zeichen wie \\\"\\\", \\\"-\\\" oder Leerzeichen enthalten! Bitte löschen Sie die alten Objekte bei Bedarf manuell.\nKonfigurationsdaten wurden für Version 2.0.0 (und neuer) geändert. Die Installation wird versuchen, Daten zu migrieren, aber es gibt eine Chance, dass dies versagt. Bitte stellen Sie sicher, dass Sie ein Backup und eine externe Dokumentation Ihrer Konfiguration vor dem Upgrade auf Version 2.0.0 oder neuer haben.",
          "ru": "Версия 1.0.0 изменит имена объектов, содержащих специальные символы, такие как \\\".\\\", \\\"-\\\" или пространства! Пожалуйста, удалите старые объекты вручную, если это необходимо.\nДанные конфигурации были изменены для версии 2.0.0 (и новее). Установка будет пытаться перенести данные, но есть шанс, что это не работает. Пожалуйста, убедитесь, что у вас есть резервное копирование и внешний документирование вашей конфигурации перед обновлением до версии 2.0.0 или новее.",
          "pt": "A versão 1.0.0 mudará os nomes de objetos contendo caracteres especiais como \\\".\\\", \\\"-\\\" ou espaços! Por favor, exclua os objetos antigos manualmente, se necessário.\nOs dados de configuração foram alterados para a versão 2.0.0 (e mais recente). A instalação tentará migrar dados, mas há uma chance de que isso falha. Certifique-se de ter um backup e uma documentação externa de sua configuração antes de atualizar para a versão 2.0.0 ou mais recente.",
          "nl": "Version 1.0.0 zal de namen veranderen van objecten met speciale personages zoals . Verwijder de oude objecten handmatig als het nodig is.\nVermoedende data is veranderd voor versie 2.0. Installatie zal proberen data te verminderen maar er is een kans dat dit mislukt. Zorg ervoor dat je een back-up hebt en een externe documentie van je zelfvertrouwen voordat je verstoort naar versie 2.0 of nieuwer.",
          "fr": "La version 1.0.0 va changer les noms des objets contenant des caractères spéciaux comme \\\".\\\", \\\"-\\\" ou des espaces! Veuillez supprimer les anciens objets manuellement si nécessaire.\nLes données de configuration ont été modifiées pour la version 2.0.0 (et plus récente). L'installation tentera de migrer les données, mais il y a une chance que cela échoue. Assurez-vous d'avoir une sauvegarde et une documentation externe de votre configuration avant de passer à la version 2.0.0 ou plus récente.",
          "it": "La versione 1.0.0 cambierà i nomi di oggetti contenenti caratteri speciali come \\\", \\\"-\\\" o spazi! Si prega di eliminare i vecchi oggetti manualmente se necessario.\nI dati di configurazione sono stati modificati per la versione 2.0.0 (e più recente). L'installazione cercherà di migrare i dati, ma c'è la possibilità che questo fallisca. Si prega di assicurarsi di avere un backup e un documento esterno della configurazione prima di aggiornare alla versione 2.0.0 o più recente.",
          "es": "Versión 1.0.0 cambiará los nombres de objetos que contienen caracteres especiales como \\\".\\\", \\\"-\\\" o espacios! Por favor, borre los viejos objetos manualmente si es necesario.\nLos datos de configuración se han modificado para la versión 2.0.0 (y más reciente). La instalación intentará migrar datos pero hay una posibilidad de que esto falle. Por favor, asegúrese de tener una copia de seguridad y una documentación externa de su configuración antes de actualizar a la versión 2.0.0 o más reciente.",
          "pl": "Wersja 1.0.0 zmienia nazwę obiektów o specjalnych postaciach, takich jak: \\, \\ lub przestrzeni! Okazuje się, że stare obiekty ręcznie będą potrzebne.\nDane konfiguracyjne zostały zmienione na wersję 2.0.0 (i nowszą). Instalacja stara się wyemitować dane, ale istnieje szansa, że to się nie udaje. Zapewniajcie, że mamy backup i zewnętrzną dokumentację twojej wersji 2.0.0 lub nowszego.",
          "zh-cn": "Version1.0.0将改变含有特殊特性的物体的名称,如乙型号、乙型号或空间。 请在必要时删除旧物体。.\n对2.0.0版本(和新版)的合并数据进行了修改。 绝大部分将试图迁移数据,但有失败的机会。 请确保在更新至2.0.0或新版之前,对你的配置进行反馈和外部记录。."
        },
        "link": "https://github.com/iobroker-community-adapters/ioBroker.snmp#changelog",
        "level": "warn",
        "linkText": {
          "en": "Changelog",
          "de": "Änderungsprotokoll",
          "ru": "Список изменений",
          "pt": "Registro de alterações",
          "nl": "Wijzigingslog",
          "fr": "Journal des modifications",
          "it": "Registro delle modifiche",
          "es": "registro de cambios",
          "pl": "Dziennik zmian",
          "zh-cn": "变更日志"
        },
        "buttons": [
          "agree",
          "cancel"
        ]
      }
    ]
  },
  "native": {},
  "objects": [],
  "instanceObjects": [
    {
      "_id": "info",
      "type": "channel",
      "common": {
        "name": "Information"
      },
      "native": {}
    },
    {
      "_id": "info.connection",
      "type": "state",
      "common": {
        "role": "indicator.connected",
        "name": "If connected to device",
        "type": "boolean",
        "read": true,
        "write": false,
        "def": false
      },
      "native": {}
    }
  ]
}
